spec/data/ccms/get_common_org_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:bill="http://legalservices.gov.uk/CCMS/Finance/Payables/1.0/BillingBIO" xmlns:casebim="http://legalservices.gov.uk/CCMS/CaseManagement/Case/1.0/CaseBIM" xmlns:casebio="http://legalservices.gov.uk/CCMS/CaseManagement/Case/1.0/CaseBIO" xmlns:clientbio="http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIO" xmlns:clientbim="http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIM" xmlns:common="http://legalservices.gov.uk/Enterprise/Common/1.0/Common" xmlns:hdr="http://legalservices.gov.uk/Enterprise/Common/1.0/Header" xmlns:refdatabim="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIM" xmlns:refdatabio="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIO" xmlns:secext="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:utility="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <secext:Security>
      <secext:UsernameToken>
        <secext:Username>my_soap_client_username</secext:Username>
        <secext:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">xxxxx</secext:Password>
      </secext:UsernameToken>
    </secext:Security>
  </soap:Header>
  <soap:Body>
    <ns2:CommonOrgInqRQ       xmlns:ns2="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIM"       xmlns="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIO"       xmlns:ns3="http://legalservices.gov.uk/Enterprise/Common/1.0/Header"       xmlns:ns4="http://legalservices.gov.uk/Enterprise/Common/1.0/Common"       xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"       xmlns:ns6="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ns3:HeaderRQ>
        <ns3:TransactionRequestID>202307061100088230354694586</ns3:TransactionRequestID>
        <ns3:Language>ENG</ns3:Language>
        <ns3:UserLoginID>JOE.BLOGGS</ns3:UserLoginID>
        <ns3:UserRole>EXTERNAL</ns3:UserRole>
      </ns3:HeaderRQ>
      <ns2:RecordCount>
        <ns4:MaxRecordsToFetch>500</ns4:MaxRecordsToFetch>
        <ns4:RetriveDataOnMaxCount>false</ns4:RetriveDataOnMaxCount>
      </ns2:RecordCount>
      <ns2:SearchCriteria>
        <ns2:Organization>
          <ns2:OrganizationName>%</ns2:OrganizationName>
          <ns2:OrganizationType>LA</ns2:OrganizationType>
        </ns2:Organization>
      </ns2:SearchCriteria>
    </ns2:CommonOrgInqRQ>
  </soap:Body>
</soap:Envelope>
